---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.Structure.RebarReinforcementData
source: html/e1df380e-37e8-0bd0-0291-fc4e8c38d747.htm
---
# RebarReinforcementData Members

Creates a new instance of RebarReinforcementData, or Nothing nullptr a null reference ( Nothing in Visual Basic) if the operation fails.